src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды/Forms/ФормаВыбораОбъектаИзТаблицы/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьТекущуюСтроку()
	
	ТекущаяСтрока = Элементы.ТаблицаОбъектов.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектПоШтрихкоду = Новый Структура;
	ОбъектПоШтрихкоду.Вставить("Объект",ТекущаяСтрока.Объект);
	ОбъектПоШтрихкоду.Вставить("ЕдиницаИзмерения",ТекущаяСтрока.ЕдиницаИзмерения);
	ОбъектПоШтрихкоду.Вставить("ХарактеристикаНоменклатуры",ТекущаяСтрока.ХарактеристикаНоменклатуры);
	ОбъектПоШтрихкоду.Вставить("Штрихкод",ТекущаяСтрока.Штрихкод);
	ОбъектПоШтрихкоду.Вставить("Запрет",ТекущаяСтрока.Запрет);
	
	ОбъектыПоШтрихкоду = Новый Массив;
	ОбъектыПоШтрихкоду.Добавить(ОбъектПоШтрихкоду);
	
	ПараметрыДействия.Вставить("ОбъектыПоШтрихкоду", ОбъектыПоШтрихкоду);
	ПараметрыДействия.Вставить("УникальныйИдентификаторФормы",ЭтотОбъект.ВладелецФормы.УникальныйИдентификатор);
	
	ШтрихкодированиеВызовСервера.ОбработкаОбъектовПоШтрихкоду(ПараметрыДействия);
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		
		ОповеститьОВыборе(ПараметрыДействия.ВыбранноеЗначение);
		
	Иначе
		
		// Вызываем общий обработчик результата выполнения действия
		УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект.ВладелецФормы, ПараметрыДействия);

		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьТекущуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьТекущуюСтроку();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДействия = Новый Структура;
	Если Параметры.Свойство("ДоступныеПоля") Тогда
		ПараметрыДействия.Вставить("ДоступныеПоля",Параметры.ДоступныеПоля);
	КонецЕсли;
	
	ВидимостьЕдиниц = Ложь;
	ВидимостьХарактеристик = Ложь;
	
	ОбъектыПоШтрихкодуОбработатьВФорме = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, ОбъектыПоШтрихкодуОбработатьВФорме, Новый Массив);
	Для Каждого ТекСтрока Из ОбъектыПоШтрихкодуОбработатьВФорме Цикл
		
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		
		Если ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмерения) Тогда
			ВидимостьЕдиниц = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.ХарактеристикаНоменклатуры) Тогда
			ВидимостьХарактеристик = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ТаблицаОбъектовЕдиницаИзмерения.Видимость = ВидимостьЕдиниц;
	Элементы.ТаблицаОбъектовХарактеристикаНоменклатуры.Видимость = ВидимостьХарактеристик;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОбъектов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПоказатьЗначение(,ТекущаяСтрока.Объект);
	КонецЕсли;
	
КонецПроцедуры
